define([],function(){

    var message = {

        108 : "该帐号在其他手机上登录!您已被强制下线!请重新登录!",

        110 : "请输入用户账号",
        111 : "请输入密码",
        112 : "请输入验证码",

        116 : "请输入手机号",
        117 : "手机号码格式错误",

        // #密码修改
        120 : "修改密码",
        121 : "请输入原密码",
        122 : "请输入新密码",
        123 : "两次输入的新密码不一致",

        125 : "手机号码格式错误",

        140 : "请完善用户信息!",
        141 : "用户昵称为空,长度过长",
        142 : "用户地址为空",
        143 : "用户性别为空",
        144 : "用户生日为空",
        145 : "用户上传头像图片为空!",
        146 : "生日格式不正确!",
        147 : "用户昵称最少4个字!",


        // #用户认证
        170 : "身份证号为空,或不合法!",
        171 : "真实姓名不可为空!",

        200 : "帖子图片不可为空!",
        201 : "该帖子不存在!",
        202 : "标签列不合法!",
        203 : "视频帖子必须有缩略图!",
        204 : "帖子必须为图片帖子或者视频帖子!",
        205 : "用户不存在!",
        206 : "回复内容不可为空!",
        207 : "回复帖子id不可为空!",
        208 : "回复对象不存在!",
        209 : "文字不可为空!",
        210 : "你已经赞过该帖子!",
        211 : "你没有赞过该帖子!",
        212 : "这不是你的帖子不能删除!",
        213 : "请选择一个标签!"

    };

    return message;

});